Revit 2027 API
DetachFromCentralOption Enumeration
 Options for workset detachment behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DetachFromCentralOption
Public Enumeration DetachFromCentralOption
public enum class DetachFromCentralOption
type DetachFromCentralOption
Members
Member name | Value | Description
ClearTransmittedSaveAsNewCentral | 3 |  After opening the transmitted, workshared model, immediately resave it with its current name and clear the transmitted flag.
DetachAndDiscardWorksets | 2 |  Detach the model being opened from its central model and discard worksets/worksharing.
DetachAndPreserveWorksets | 1 |  Detach the file being opened from its central file.
DoNotDetach | 0 |  Do not detach the file being opened from its central file.
See Also
Reference
Autodesk.Revit.DB Namespace